In [8]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from fancyimpute import KNN 
import seaborn as sns


data = pd.read_excel('lab4Kucheriaviy.xlsm')
data.head()

  First name  Last name                 country car make  car model year
0   Karlotte   Dilgarno                 Tunisia   Suzuki             NaN
1     Jelene    Sayburn                   China     Jeep          2008.0
2     Linell     Runham  Bosnia and Herzegovina    Isuzu             NaN
3     Hilary  Braidwood                   China     Ford          2004.0
4    Mariele   Gorringe                  Russia    Acura          1990.0

In [9]:
nanToZero = data.fillna(0)
nanToZero.head()

  First name  Last name                 country car make  car model year
0   Karlotte   Dilgarno                 Tunisia   Suzuki             0.0
1     Jelene    Sayburn                   China     Jeep          2008.0
2     Linell     Runham  Bosnia and Herzegovina    Isuzu             0.0
3     Hilary  Braidwood                   China     Ford          2004.0
4    Mariele   Gorringe                  Russia    Acura          1990.0

In [10]:
nanToAVG = data.fillna(round(data['car model year'].mean()))
nanToAVG.head()

  First name  Last name                 country car make  car model year
0   Karlotte   Dilgarno                 Tunisia   Suzuki          2000.0
1     Jelene    Sayburn                   China     Jeep          2008.0
2     Linell     Runham  Bosnia and Herzegovina    Isuzu          2000.0
3     Hilary  Braidwood                   China     Ford          2004.0
4    Mariele   Gorringe                  Russia    Acura          1990.0

In [11]:
dataForRegresion = data.copy()

filedData = dataForRegresion[dataForRegresion['car model year'].notna()]
missedData = dataForRegresion[dataForRegresion['car model year'].isna()]

attrebutes = filedData[['car make', 'country']]
encodedAttributes = pd.get_dummies(attrebutes, columns=['car make', 'country'], drop_first=True)
values = filedData['car model year']

model = LinearRegression()
model.fit(encodedAttributes, values)

missingAttrebutes = missedData[['car make', 'country']]
missingAttrebutesEncoded = pd.get_dummies(missingAttrebutes, columns=['car make', 'country'], drop_first=True)
missingAttrebutesEncoded = missingAttrebutesEncoded.reindex(columns=encodedAttributes.columns, fill_value=0)
prediction = model.predict(missingAttrebutesEncoded)

dataForRegresion.loc[dataForRegresion['car model year'].isna(), 'car model year'] = np.round(prediction)
dataForRegresion.head()

  First name  Last name                 country car make  car model year
0   Karlotte   Dilgarno                 Tunisia   Suzuki          2001.0
1     Jelene    Sayburn                   China     Jeep          2008.0
2     Linell     Runham  Bosnia and Herzegovina    Isuzu          1986.0
3     Hilary  Braidwood                   China     Ford          2004.0
4    Mariele   Gorringe                  Russia    Acura          1990.0

In [12]:
data.head()

  First name  Last name                 country car make  car model year
0   Karlotte   Dilgarno                 Tunisia   Suzuki             NaN
1     Jelene    Sayburn                   China     Jeep          2008.0
2     Linell     Runham  Bosnia and Herzegovina    Isuzu             NaN
3     Hilary  Braidwood                   China     Ford          2004.0
4    Mariele   Gorringe                  Russia    Acura          1990.0

In [13]:
imputer = KNN(k=5)
encodedData = pd.get_dummies(data, drop_first=True)
iData = imputer.fit_transform(encodedData)
result = pd.DataFrame(iData, columns = encodedData.columns)
data.loc[:, 'car modelS year'] = result['car model year']
data.head()

Imputing row 1/1000 with 1 missing, elapsed time: 9.078
Imputing row 101/1000 with 0 missing, elapsed time: 9.079
Imputing row 201/1000 with 0 missing, elapsed time: 9.079
Imputing row 301/1000 with 0 missing, elapsed time: 9.079
Imputing row 401/1000 with 0 missing, elapsed time: 9.080
Imputing row 501/1000 with 0 missing, elapsed time: 9.080
Imputing row 601/1000 with 0 missing, elapsed time: 9.081
Imputing row 701/1000 with 0 missing, elapsed time: 9.081
Imputing row 801/1000 with 0 missing, elapsed time: 9.082
Imputing row 901/1000 with 0 missing, elapsed time: 9.082

  First name  Last name                 country car make  car model year
0   Karlotte   Dilgarno                 Tunisia   Suzuki     2002.600035
1     Jelene    Sayburn                   China     Jeep     2008.000000
2     Linell     Runham  Bosnia and Herzegovina    Isuzu     2001.000035
3     Hilary  Braidwood                   China     Ford     2004.000000
4    Mariele   Gorringe                  Russia    Acura     1990.000000

In [25]:
whr = pd.read_csv("whr.csv")
cr = whr[["Happiness score", "Log GDP per capita", "Healthy life expectancy at birth", "Freedom to make life choices", "Generosity"]].corr()
sns.heatmap(cr)

                    Happiness score  Log GDP per capita
Happiness score            1.000000            0.784562
Log GDP per capita         0.784562            1.000000

AttributeError: 'DataFrame' object has no attribute 'len'